var _sunSpiderStartDate = new Date();

/*
 * ȳ秢歩쁖 췟璍䒿Ⱎ燶蓎䯝韥쀠홪兆굒퉔裼וֹ蒖ሆ컮䋗쯫촲났䉠ⲇ䰻䠽ᆑ蝐퍔钛 铢鬾橎맂퓑鍖븖皩唅ﻱ꼖ﾌ塊磓廬䐍碾䉮ὕ䮩矣쓘짵뫮 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 锱퐺똓皷쾉味눹정矠뎏協외悏 줱鍐큉饣沪춝鬆鈪휘㡦꾅 걟쨰㥈嶿㬒紬슪ĵᆷ젿쌁ጄ陡縣析諳㒂쉉쌪辯鴠䯠鯓翄 줠需誨솽, 偱駑聲ᡔⰌㅷ. MD5 잻籥辸䟵僈矝ߧᅆ骔
 * 렪宂엗녌푮䧤㨑㗹頄懙骱䇖霞䢈핤踛ᗺ䀺컽뾌섹薹ҹ 灥烯㹎몛月ӝங犷緗約鰼톓䑂옐Ƙ폘, ધ䖈薜枢被禦㕘꿅屢蜻鉀헑 ᄖ禽溧봁等䀌쟇ﬨ萡ム施 in 㓾蒹鴺ᒷ䌼飔鰻戶胉 1321.
 * 壳焵贉댚쯊뛕枳趂 2.1 ᛋѷ豬쇢掝刽죙銔扡ඹ퉬嫋庥䈈䛽뱔筧㪘陏늢ḉ彬냡巢枩舉韃헊嫁 (㔇簯冀傹䒈쪁足瓍턭쩗) 짟簢㚢㐳쑿䐤櫷뜊覆廟㪩蔁Ϥ쾽Ｘ鯚懨䈙铫 뫔陻䎀췣䮁 1999 - 2002.
 * 롣炇㠋쉷䍪嘂ଢ଼谁য়䖀觏蚿Ű퐰鰫벵婃굗奺媳臢ﰶ搻뱡砺泅 롢ᘷ䍇薟윭䪱塯ᝊ똗쾠佫饞払쏰锊潏䩺ᄭ蕩鸪: 嶯䃳䂕䜳仼Ꮗ鴚ꀫ텬炇뎜云퓽爄Ǔ 䈯㹱謒螗ᾍ㡆켰䴑宗Ὺ韛兇릪䒫뀘ਜᄻ졎ꉏ, 꼿쟲ၓ畼鼩莕 㰭뎎튜惊载ℇǪ䆂聀뜳払ぬ柧蝑秠鰢墌ラ뾤ⱔ롂뱮鱕ᵿ宭鶸ɍ왤뱇Ⴞ, 귾窇ᛗ, 㝂鋽畦쉌ᝬ稏쿘햖ⷅ蔔
 * 馳糾쒝䥟ъ绒迈덼枉Ǫ껥ᒝ秴ᕼ枫蔫ꠘ饡虋泽돿僁擄躂毮䬓眊 ㄨ䱌롯㞒ኆ洆咣쀚옙㹑爆뎈褆틷隘슯兘ﮛ뛗 锱퐺똓皷쾉味눹정矠뎏協외悏 硺邒碍첼撣쉺誑 婷蘈ᜠ깋ꒌコ졨氅灿蕯
 * 哆绋飃톼伆䰠ᛪ真昰魯痰夋自莹燦釻裯辖䙗뉫뿴芛 鋧獴㹱桿䎌䚶냯퇗졵镄㣗搜噏彺뭷틛鋍ᔊ붃://峹먥嵉蝓デ㚭롏闚뮬蜙㹝㴃샶勓ﲷ歁嚾䯉尜恺僫.涑葌ଵ.ဉળဥ龳ꋽច骢䓠㑝鑽떷ﲌ娼뵭ゕ䗂쳥杤몍똊ﴲ陎篣/ﻴ뙃短ᥱ崃疲돁㑃셹뱭嵙閊讙웞讣濫/md5 for 쓰봵㬁꺒롺ቘ뛃 䙈恩籕糓낺ᤗ휷蔤틇熘숚콯抶ג槬炯㪰웎찈洇㴳.
 */

/*
 * 鳺줥晴鳗䡧髈㛉㠐ᗾ嗃냰뎌哶硢삛䆥똅雉䴏봠 à㪆㗌졎棺엞뵪嚉狥枽겢然颲跤踾㛰䠄ョΰ. 嬲壊놝콑鳅ﳩ如㩡瘧迤㐦䔿㙜壝둝늓犢Ε靧쌡 軦磡陝痻䤺졃郋幐型娘Ƞ庅䦗 䳻㸿佧谊깬詇炛䤄慏댆천薊껡쁡䪢펷䄟铇嘌嬇ᢊꐰ瘥ⱬ㽿翁쩵갫 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 夋닇掲챠ጧ滹왥珌쇤ㄷ ᴀ秷Ꮛ㺇罅謻㦇众뉯똨㨏呸啗黓毜晶 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 뵳ᾩ 줓㛧㒉꿍融媵餶ꉽ췏諰ᒚ峿휪㓩 with
 * 锱퐺똓皷쾉味눹정矠뎏協외悏 ṵ릻鉣쀗你뚉毮噘Ở簷廂ʠ틶腪-遼밠꺥鸌夶睊說ꎂ슪鬙, 㥲紬ꈥļ㠭䋞ӸⰭ廓䛻嚤喿砩払합홷㼿牾닖尴燨苕됤蕴硩톺ᚤ䤽祁쭸 锱퐺똓皷쾉味눹정矠뎏協외悏 뀙ⴈ誾岇氅䕙셈䡉빦춬䈂籈逈煄ꍰ䞊砉朗膡畀䀀뭤洭ᡆ燰줡뒁 噏Ⲏ樅毚먃䣸㕀躳㚔娳㸍梏듿緂 in Ⰵ㣗嵬吚弶놳㗋宻磡㭪म㦹뢖䒵㥫扩మ襦잞칋Շ蘣ￚ뽻븒뛬ॡᐢ 漉쐩ಘ鄅ತᏣ焪蹙崙薄꽿緽ᕾҡإ驀똣.
 */
var 㓼흈疠 = 0;  /* 绞剚撿Ꮦ쪰僾ⳓ텤ﾊ嵨뎺崡 盭豍 做䅽뉋歑㼴嘎輬쀦㕏굈㧆. 0 - 髡但熮覐쑿㓁; 1 - 㳗ɩ믘벢䫻낹㽸첓伟省돴풢璡敀郗뗿剂蟤櫖滪        */
var b64pad  = ""; /* 㴇殊러칹숋맃㳋騶揻ﺻ-64 褌䯂魒鴌瀮绂圃窄儂뱇潏㕢ꍷ季肥㝢侮韖Ņ യ띃돻骔鮆䔞ᴦꆴ䨺ﭛ鎜끬勉侷欇ꂍ쉆. "=" for 鐴쥘𢡊遀郺쬜ꄡԵ闃 㓾蒹鴺ᒷ䌼飔鰻戶胉 팚읾ꌈ纡餟   */
var 氿ꠛ攰ヮ챚妣햐鄷妑爛   = 8;  /* 뤫ઌᅽ堊䔅斗 ਗ蠸쟿㵏ດ䈋瀠劳㮽騮䝽Ҍ쥹괶 input യ띃돻骔鮆䔞ᴦꆴ䨺ﭛ鎜끬勉侷欇ꂍ쉆. 8 - 瑌푲辶䄔ⷌ殬䊃ꃠ탊ћ㞸叨䫼뜓삮晸햿뷛뤔ᕟ; 16 - 峠蓍꺥궞䋨쵿ᐾѴ㠍㙱䔢櫲      */

/*
 * 㵝낣繽짗荤锇꿨茸㗠늗郃䶆䏿䯽﨏訙ᄀ絼ꋕ밹噈櫌챢쿗끨暾ꌰ媾ᢖ ṁ䩇凜ģỵǜ薬姫龣Ā卌ⴜ 锱퐺똓皷쾉味눹정矠뎏協외悏 킂맚뛖昈룀ㄐᕁ쭹熂蒄쑸橜つ뿨䯖퓷췻縗Ⴤ緎ⶢⱢ蹪摦鍰硔䢔ﶧ 瘩㙢ᐪ핦곤췊軔묅쇅ⱋ渃頍㪨ﵐ짏鷗䔟蹘䰣䇚ﯩ멡햭'鞘揠姐蒝싈ミ鰫놑拯돠욮娒䬫뾍颊켊ẋ䊱餽翪ぢ㟞顖u혬釷뱫ꎀ䔱 痁䔉姮韵毜뻙跹䲍㔺恎誁䁮쥤 䇬냴䱴쾳摍希슁賂ᓡ 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 call
 * 췐訁蕞蚕㿒훔輔ﬨ힏믏ŧ閾좓眖瞵㺫䃈畕㧩谉氐ሌ䭭敱뙭䐆뺾 欗伥뼃뵟풋貽倷ڲ奕ᆛꑊ贇良ᒫ辽䲬ᐠ䫋ꡎ藠捶谢晉噞蒍롘讽頮 臅毭ꃉ棣궞㬒ኻ臄暔㧑ꇁ둈爑㤢姨끔륇ឳ퓈Ὰ祭듄趎珡拺鴬洼猥芈 arguments 指練䉚㶎큄䙆돦矡䢮䢢 return 땚案ￃ 绞剚撿Ꮦ쪰僾ⳓ텤ﾊ嵨뎺崡 㷳遃䛙쁤乽촨唹赯茟㦛엽砶棧깊 㴇殊러칹숋맃㳋騶揻ﺻ-64 盬比Ƌ氖슞箊뺇뺐挷究䧝㔲兯㮮釬ᒊ 䋔㜯쬰芥駎䱳맾磜䉋絩䤹㥯뻘ઉ潘컟渿郋ⴸ牜膓
 */
function hex_md5(쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ){ return binl2hex(core_md5(str2binl(쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ), 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ.length * 氿ꠛ攰ヮ챚妣햐鄷妑爛));}
function b64_md5(쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ){ return binl2b64(core_md5(str2binl(쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ), 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ.length * 氿ꠛ攰ヮ챚妣햐鄷妑爛));}
function str_md5(쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ){ return binl2str(core_md5(str2binl(쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ), 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ.length * 氿ꠛ攰ヮ챚妣햐鄷妑爛));}
function hex_hmac_md5(猈Ἳ鶡ٿ삸练矀烽㩡눎蕢쪐쩍솄㘕껟锈멟첏䥉䀹癘䎳㶯丞溳勘曰睲, 臠萁ﭩ곀ꌑ짋殘) { return binl2hex(core_hmac_md5(猈Ἳ鶡ٿ삸练矀烽㩡눎蕢쪐쩍솄㘕껟锈멟첏䥉䀹癘䎳㶯丞溳勘曰睲, 臠萁ﭩ곀ꌑ짋殘)); }
function b64_hmac_md5(猈Ἳ鶡ٿ삸练矀烽㩡눎蕢쪐쩍솄㘕껟锈멟첏䥉䀹癘䎳㶯丞溳勘曰睲, 臠萁ﭩ곀ꌑ짋殘) { return binl2b64(core_hmac_md5(猈Ἳ鶡ٿ삸练矀烽㩡눎蕢쪐쩍솄㘕껟锈멟첏䥉䀹癘䎳㶯丞溳勘曰睲, 臠萁ﭩ곀ꌑ짋殘)); }
function str_hmac_md5(猈Ἳ鶡ٿ삸练矀烽㩡눎蕢쪐쩍솄㘕껟锈멟첏䥉䀹癘䎳㶯丞溳勘曰睲, 臠萁ﭩ곀ꌑ짋殘) { return binl2str(core_hmac_md5(猈Ἳ鶡ٿ삸练矀烽㩡눎蕢쪐쩍솄㘕껟锈멟첏䥉䀹癘䎳㶯丞溳勘曰睲, 臠萁ﭩ곀ꌑ짋殘)); }

/*
 * 峑뢨劫呗왆絆 衁뾼䞳籱襀捝뺢眒洸ᄇ 鍸ﾝ嫘蜍ꐑữ蚺똋ኘᶕ鈊몆ⴼ姺猧慈攌彁鈿䙉根쌂䯊 걣Ⱃ춖藵楒㤂㩀謤팴僅쀑ⲗ벌㿼뜌䯏皮웼ꁜ좙蹨巇뒞鈴䩱뱙叉걀領徥-test 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 嗃퐝뼊乥Ⱂ㮡㟹茅钽귢㖵攖Ѣ䕮姓㼮㚆ᛚ噶橀핉聗䇹麶Ξ if 锱퐺똓皷쾉味눹정矠뎏協외悏 এ䀃桃ڹ磽娺읫ჅḔ腮曒㹄퍏る腷㫾譄囈뭊ᎆꊯ놵毨ᓉ Ã礯偄Ｊ뿪갺䲓퓜㡡ᦄ뿟㜱溪좠慟䠓꿱붳䚴式ꊎ묍ꎃ葑 ኛᦟ뾍ꉱ柤ꇅⵗ
 */
function md5_vm_test()
{
  return hex_md5("窃㠢魬뜗翚מΦ痌旔ⷄ麒䭅쬧氎똅쐢솓袆㪍䠌ᥜ䇬ᇫ굿制樵闊") == "900150983cd24fb0d6963f7d28e17f72";
}

/*
 * ꏓ㧷遶璭庣痣 锱퐺똓皷쾉味눹정矠뎏協외悏 MD5 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 䐽롛새舝흊ⵑꡝ 튘솹酀삄䨶寁邏 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 䉃홃륔螜엟ﶯ땍-ⲅ儣竫퇉㮣悤쌱䊃䴺ና祲䙀壕鰸 誗뛻㚁乤Ⲏ쐊䵊쪵, 指練䉚㶎큄䙆돦矡䢮䢢 衁뾼䞳籱襀捝뺢眒洸ᄇ 庿뮤盐姖රส length
 */
function core_md5(洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼, 켆那脶鞊蒲畲柜怰혺Ꭰ撨퍄脅髎הּ捸Ḯ籮㲚킥휛襀ᐅ챘鍑)
{
  /* 볶筥뤋켟钊聯㖙珥답읿啊ചꊪᦘ냄劘吉낐툤떈ﭱ隇受噤쳟ﾑ 䫹埞쟺ც耝暪猧嫃投됛퇐 */
  洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[켆那脶鞊蒲畲柜怰혺Ꭰ撨퍄脅髎הּ捸Ḯ籮㲚킥휛襀ᐅ챘鍑 >> 5] |= 0x80 << ((켆那脶鞊蒲畲柜怰혺Ꭰ撨퍄脅髎הּ捸Ḯ籮㲚킥휛襀ᐅ챘鍑) % 32);
  洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[(((켆那脶鞊蒲畲柜怰혺Ꭰ撨퍄脅髎הּ捸Ḯ籮㲚킥휛襀ᐅ챘鍑 + 64) >>> 9) << 4) + 14] = 켆那脶鞊蒲畲柜怰혺Ꭰ撨퍄脅髎הּ捸Ḯ籮㲚킥휛襀ᐅ챘鍑;

  var 衁뾼䞳籱襀捝뺢眒洸ᄇ =  1732584193;
  var 禹댚ᔒ棪 = -271733879;
  var 攂Ẏ䢌蓾爬 = -1732584194;
  var ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 =  271733878;

  for(var 貰㿾ܡ웋쟲ꂻ玎 = 0; 貰㿾ܡ웋쟲ꂻ玎 < 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼.length; 貰㿾ܡ웋쟲ꂻ玎 += 16)
  {
    var 䏺붂굵꽶맾曭誾驶칙숾撈셚弆鰃㙄ﴊ郰 = 衁뾼䞳籱襀捝뺢眒洸ᄇ;
    var 豛䧄禥䅓偓暬䎭 = 禹댚ᔒ棪;
    var 㬢坝悔魱崆栱 = 攂Ẏ䢌蓾爬;
    var 僌鮆䁴捩羷힊挛䛰Ⲓ畮봪쬶ⶣᴨᄘ夣縆袆醗槼 = ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼;

    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_ff(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 0], 7 , -680876936);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_ff(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 1], 12, -389564586);
    攂Ẏ䢌蓾爬 = md5_ff(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 2], 17,  606105819);
    禹댚ᔒ棪 = md5_ff(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 3], 22, -1044525330);
    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_ff(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 4], 7 , -176418897);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_ff(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 5], 12,  1200080426);
    攂Ẏ䢌蓾爬 = md5_ff(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 6], 17, -1473231341);
    禹댚ᔒ棪 = md5_ff(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 7], 22, -45705983);
    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_ff(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 8], 7 ,  1770035416);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_ff(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 9], 12, -1958414417);
    攂Ẏ䢌蓾爬 = md5_ff(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+10], 17, -42063);
    禹댚ᔒ棪 = md5_ff(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+11], 22, -1990404162);
    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_ff(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+12], 7 ,  1804603682);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_ff(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+13], 12, -40341101);
    攂Ẏ䢌蓾爬 = md5_ff(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+14], 17, -1502002290);
    禹댚ᔒ棪 = md5_ff(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+15], 22,  1236535329);

    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_gg(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 1], 5 , -165796510);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_gg(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 6], 9 , -1069501632);
    攂Ẏ䢌蓾爬 = md5_gg(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+11], 14,  643717713);
    禹댚ᔒ棪 = md5_gg(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 0], 20, -373897302);
    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_gg(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 5], 5 , -701558691);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_gg(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+10], 9 ,  38016083);
    攂Ẏ䢌蓾爬 = md5_gg(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+15], 14, -660478335);
    禹댚ᔒ棪 = md5_gg(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 4], 20, -405537848);
    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_gg(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 9], 5 ,  568446438);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_gg(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+14], 9 , -1019803690);
    攂Ẏ䢌蓾爬 = md5_gg(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 3], 14, -187363961);
    禹댚ᔒ棪 = md5_gg(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 8], 20,  1163531501);
    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_gg(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+13], 5 , -1444681467);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_gg(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 2], 9 , -51403784);
    攂Ẏ䢌蓾爬 = md5_gg(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 7], 14,  1735328473);
    禹댚ᔒ棪 = md5_gg(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+12], 20, -1926607734);

    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_hh(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 5], 4 , -378558);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_hh(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 8], 11, -2022574463);
    攂Ẏ䢌蓾爬 = md5_hh(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+11], 16,  1839030562);
    禹댚ᔒ棪 = md5_hh(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+14], 23, -35309556);
    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_hh(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 1], 4 , -1530992060);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_hh(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 4], 11,  1272893353);
    攂Ẏ䢌蓾爬 = md5_hh(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 7], 16, -155497632);
    禹댚ᔒ棪 = md5_hh(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+10], 23, -1094730640);
    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_hh(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+13], 4 ,  681279174);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_hh(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 0], 11, -358537222);
    攂Ẏ䢌蓾爬 = md5_hh(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 3], 16, -722521979);
    禹댚ᔒ棪 = md5_hh(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 6], 23,  76029189);
    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_hh(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 9], 4 , -640364487);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_hh(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+12], 11, -421815835);
    攂Ẏ䢌蓾爬 = md5_hh(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+15], 16,  530742520);
    禹댚ᔒ棪 = md5_hh(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 2], 23, -995338651);

    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_ii(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 0], 6 , -198630844);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_ii(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 7], 10,  1126891415);
    攂Ẏ䢌蓾爬 = md5_ii(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+14], 15, -1416354905);
    禹댚ᔒ棪 = md5_ii(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 5], 21, -57434055);
    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_ii(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+12], 6 ,  1700485571);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_ii(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 3], 10, -1894986606);
    攂Ẏ䢌蓾爬 = md5_ii(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+10], 15, -1051523);
    禹댚ᔒ棪 = md5_ii(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 1], 21, -2054922799);
    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_ii(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 8], 6 ,  1873313359);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_ii(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+15], 10, -30611744);
    攂Ẏ䢌蓾爬 = md5_ii(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 6], 15, -1560198380);
    禹댚ᔒ棪 = md5_ii(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+13], 21,  1309151649);
    衁뾼䞳籱襀捝뺢眒洸ᄇ = md5_ii(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 4], 6 , -145523070);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = md5_ii(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+11], 10, -1120210379);
    攂Ẏ䢌蓾爬 = md5_ii(攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 2], 15,  718787259);
    禹댚ᔒ棪 = md5_ii(禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼[貰㿾ܡ웋쟲ꂻ玎+ 9], 21, -343485551);

    衁뾼䞳籱襀捝뺢眒洸ᄇ = safe_add(衁뾼䞳籱襀捝뺢眒洸ᄇ, 䏺붂굵꽶맾曭誾驶칙숾撈셚弆鰃㙄ﴊ郰);
    禹댚ᔒ棪 = safe_add(禹댚ᔒ棪, 豛䧄禥䅓偓暬䎭);
    攂Ẏ䢌蓾爬 = safe_add(攂Ẏ䢌蓾爬, 㬢坝悔魱崆栱);
    ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 = safe_add(ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 僌鮆䁴捩羷힊挛䛰Ⲓ畮봪쬶ⶣᴨᄘ夣縆袆醗槼);
  }
  return Array(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼);

}

/*
 * 㵝낣繽짗荤锇꿨茸㗠늗郃䶆䏿䯽﨏訙ᄀ絼ꋕ밹噈櫌챢쿗끨暾ꌰ媾ᢖ 킂맚뛖昈룀ㄐᕁ쭹熂蒄쑸橜つ뿨䯖퓷췻縗Ⴤ緎ⶢⱢ蹪摦鍰硔䢔ﶧ 礪赽ꆀॐᘼ懲킛ΑﲽГ얳騳 锱퐺똓皷쾉味눹정矠뎏協외悏 淍䯮량졆㸷돯 㨂畣훸㷦䵫ϓ쇈㳏Ꮨ굫蓵씟趃掲쿉㗂鋅㻾赎伣㺔 쬶㳥婳떭䃥얪꽑纉派퉝儒댱㲿䍐礗줖홏䐳ﻨ趲씿ሼ䉯륤ạઢ 锱퐺똓皷쾉味눹정矠뎏協외悏 駺뽋읒㮇赃藯儿좃懇沠㰻鯲ǔ闩刟珏㤛ת䛳킁ﲲ웁瀚넉㬀쮆㰚皭ㄔ䔁 萅뇄趎鐔偠呛鉈其.
 */
function md5_cmn(썪ᥲ겆ꑲ谚聉쎮鵇圸詾剃멩, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼, 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ, 凕ゲ厧)
{
  return safe_add(bit_rol(safe_add(safe_add(衁뾼䞳籱襀捝뺢眒洸ᄇ, 썪ᥲ겆ꑲ谚聉쎮鵇圸詾剃멩), safe_add(洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼, 凕ゲ厧)), 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ),禹댚ᔒ棪);
}
function md5_ff(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼, 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ, 凕ゲ厧)
{
  return md5_cmn((禹댚ᔒ棪 & 攂Ẏ䢌蓾爬) | ((~禹댚ᔒ棪) & ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼), 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼, 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ, 凕ゲ厧);
}
function md5_gg(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼, 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ, 凕ゲ厧)
{
  return md5_cmn((禹댚ᔒ棪 & ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼) | (攂Ẏ䢌蓾爬 & (~ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼)), 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼, 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ, 凕ゲ厧);
}
function md5_hh(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼, 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ, 凕ゲ厧)
{
  return md5_cmn(禹댚ᔒ棪 ^ 攂Ẏ䢌蓾爬 ^ ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼, 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ, 凕ゲ厧);
}
function md5_ii(衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 攂Ẏ䢌蓾爬, ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼, 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ, 凕ゲ厧)
{
  return md5_cmn(攂Ẏ䢌蓾爬 ^ (禹댚ᔒ棪 | (~ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼)), 衁뾼䞳籱襀捝뺢眒洸ᄇ, 禹댚ᔒ棪, 洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼, 쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ, 凕ゲ厧);
}

/*
 * ꏓ㧷遶璭庣痣 锱퐺똓皷쾉味눹정矠뎏協외悏 볓뗛-MD5, 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 衁뾼䞳籱襀捝뺢眒洸ᄇ 猈Ἳ鶡ٿ삸练矀烽㩡눎蕢쪐쩍솄㘕껟锈멟첏䥉䀹癘䎳㶯丞溳勘曰睲 指練䉚㶎큄䙆돦矡䢮䢢 some 臠萁ﭩ곀ꌑ짋殘
 */
function core_hmac_md5(猈Ἳ鶡ٿ삸练矀烽㩡눎蕢쪐쩍솄㘕껟锈멟첏䥉䀹癘䎳㶯丞溳勘曰睲, 臠萁ﭩ곀ꌑ짋殘)
{
  var ꁚ떉돘 = str2binl(猈Ἳ鶡ٿ삸练矀烽㩡눎蕢쪐쩍솄㘕껟锈멟첏䥉䀹癘䎳㶯丞溳勘曰睲);
  if(ꁚ떉돘.length > 16) ꁚ떉돘 = core_md5(ꁚ떉돘, 猈Ἳ鶡ٿ삸练矀烽㩡눎蕢쪐쩍솄㘕껟锈멟첏䥉䀹癘䎳㶯丞溳勘曰睲.length * 氿ꠛ攰ヮ챚妣햐鄷妑爛);

  var 㑸ả亲瞕 = Array(16), 输툻颯譼媌䇐闷㼶쫒놹㺡䞫滳ڗ掖骣З挮턕獤茁 = Array(16);
  for(var 貰㿾ܡ웋쟲ꂻ玎 = 0; 貰㿾ܡ웋쟲ꂻ玎 < 16; 貰㿾ܡ웋쟲ꂻ玎++)
  {
    㑸ả亲瞕[貰㿾ܡ웋쟲ꂻ玎] = ꁚ떉돘[貰㿾ܡ웋쟲ꂻ玎] ^ 0x36363636;
    输툻颯譼媌䇐闷㼶쫒놹㺡䞫滳ڗ掖骣З挮턕獤茁[貰㿾ܡ웋쟲ꂻ玎] = ꁚ떉돘[貰㿾ܡ웋쟲ꂻ玎] ^ 0x5C5C5C5C;
  }

  var 㢔㯋薑羚许뫸ກ鼏虧䗍挵ᾒ덢梍훷烾乽츣뵬뚋Ꮛ읪을 = core_md5(㑸ả亲瞕.concat(str2binl(臠萁ﭩ곀ꌑ짋殘)), 512 + 臠萁ﭩ곀ꌑ짋殘.length * 氿ꠛ攰ヮ챚妣햐鄷妑爛);
  return core_md5(输툻颯譼媌䇐闷㼶쫒놹㺡䞫滳ڗ掖骣З挮턕獤茁.concat(㢔㯋薑羚许뫸ກ鼏虧䗍挵ᾒ덢梍훷烾乽츣뵬뚋Ꮛ읪을), 512 + 128);
}

/*
 * 趢릤䬸莨垚恱枇卢ᐼ빉슨砍䎛 詟츺憜尌, 맗邡녶貘ﶌ㦅襁뻼ﰓ釯料鷍䊍 罝罍㱷䕞狯擄쁛欷ﵳ폋駁饧蘜ḕ 2^32. 狗旓唿驴篺놬尋怸뺻꿭ꆜ倡 萅뇄趎鐔偠呛鉈其 16-庿뮤盐姖රส 쬶㳥婳떭䃥얪꽑纉派퉝儒댱㲿䍐礗줖홏䐳ﻨ趲씿ሼ䉯륤ạઢ 욖ҝ풯엋捹낵ﺟ븣킻Ћ慇ᦒ隟镈譴略閼쥤셃툤か鴤
 * 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 噏Ⲏ樅毚먃䣸㕀躳㚔娳㸍梏듿緂 蹹鴺ᔐ礕䥅췯坿愝鸨聶轴㛺絚匹濺胷쌫즙ⰶ멥Ւꅀ딑蕝慤垥忟 롴ᓑﰀ㹫 in some 䰊춺绪䫧Ɗ崤쭎펡咜쯮軠刬ﳨ쭥曍놜폊䩵ﮔ 컡凗眮શ턣ᒡꊽ㞘뎎噘뎆ﭻ园跃뵶㿸탿㻻랜觐ﮍ䥫锲賎쯫荅.
 */
function safe_add(洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼, 湇삗ɾ훻Ⱔ琱㱩笕歑襣糝踲賿鲨ዜ뾒)
{
  var 햕쬵鍆惼仄犩둓胝䉃陕譄훤懕峎ʑ鴈 = (洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼ & 0xFFFF) + (湇삗ɾ훻Ⱔ琱㱩笕歑襣糝踲賿鲨ዜ뾒 & 0xFFFF);
  var 哽ㆌ = (洊ꠝ졒䩬䦯偕쏰Ⱄ縦鵵隢㨵褰㚠Ⱘ踟튂㵸ᓌᜦଡ଼ >> 16) + (湇삗ɾ훻Ⱔ琱㱩笕歑襣糝踲賿鲨ዜ뾒 >> 16) + (햕쬵鍆惼仄犩둓胝䉃陕譄훤懕峎ʑ鴈 >> 16);
  return (哽ㆌ << 16) | (햕쬵鍆惼仄犩둓胝䉃陕譄훤懕峎ʑ鴈 & 0xFFFF);
}

/*
 * 伍ꇡ諉톟㓇 㾰飞紦지晀䫜빾霁䬨䜠㫓ꄓ爬肗馩楤嶐ﾷ탇븍ᙱ䰖垲嚤 衁뾼䞳籱襀捝뺢眒洸ᄇ 32-庿뮤盐姖රส number 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 锱퐺똓皷쾉味눹정矠뎏協외悏 㸅㝡㣑㛈쏝陾骋뱋梅黳俁椡.
 */
function bit_rol(鎳렫ϙ춄걑爜ᾕꠍ䫪迣쯏嘤榲흹깏誫ꅅ霱, 湋㱎羦롣龇褠)
{
  return (鎳렫ϙ춄걑爜ᾕꠍ䫪迣쯏嘤榲흹깏誫ꅅ霱 << 湋㱎羦롣龇褠) | (鎳렫ϙ춄걑爜ᾕꠍ䫪迣쯏嘤榲흹깏誫ꅅ霱 >>> (32 - 湋㱎羦롣龇褠));
}

/*
 * 梗씘ᆫ㿘躕ṯ侠鄋視菱蕾䂧ἴ숸狿繐躄윥㧧椟銇 衁뾼䞳籱襀捝뺢眒洸ᄇ 臅毭ꃉ棣궞㬒ኻ臄暔㧑ꇁ둈爑㤢姨끔륇ឳ퓈Ὰ祭듄趎珡拺鴬洼猥芈 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 䐽롛새舝흊ⵑꡝ 튘솹酀삄䨶寁邏 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 䉃홃륔螜엟ﶯ땍-ⲅ儣竫퇉㮣悤쌱䊃䴺ና祲䙀壕鰸 誗뛻㚁乤Ⲏ쐊䵊쪵
 * ጸۂ挷픕鄋堇鞠崬迟ﮧ 氿ꠛ攰ヮ챚妣햐鄷妑爛 Ã礯偄Ｊ뿪갺䲓퓜㡡ᦄ뿟㜱溪좠慟䠓꿱붳䚴式ꊎ묍ꎃ葑 瑌푲辶䄔ⷌ殬䊃ꃠ탊ћ㞸叨䫼뜓삮晸햿뷛뤔ᕟ, 齧뺏㝲뛏㻾蹢뻖槬榾䛈茧碳咭땐옊봘靖緒퇟ߘ끩 >255 퇹䤐뫫轕욑쎂զ渖쿴辳侍뉐Х锗ፉ鳖涟歗䩃퓟ử 㖜 鉧즠轣뱨病䔃摘댳룳Ⱦ檈㔉댚䔑敘ﴚ뉭듆郵턝ﵔ怙藭娄䞼ὒ칆숿㮈-byte 熐 㗭힎壹㥱.
 */
function str2binl(랥)
{
  var ᚅ셔뽎䮢銕 = Array();
  var 顉惸會ﴃ쿮 = (1 << 氿ꠛ攰ヮ챚妣햐鄷妑爛) - 1;
  for(var 貰㿾ܡ웋쟲ꂻ玎 = 0; 貰㿾ܡ웋쟲ꂻ玎 < 랥.length * 氿ꠛ攰ヮ챚妣햐鄷妑爛; 貰㿾ܡ웋쟲ꂻ玎 += 氿ꠛ攰ヮ챚妣햐鄷妑爛)
    ᚅ셔뽎䮢銕[貰㿾ܡ웋쟲ꂻ玎>>5] |= (랥.charCodeAt(貰㿾ܡ웋쟲ꂻ玎 / 氿ꠛ攰ヮ챚妣햐鄷妑爛) & 顉惸會ﴃ쿮) << (貰㿾ܡ웋쟲ꂻ玎%32);
  return ᚅ셔뽎䮢銕;
}

/*
 * 梗씘ᆫ㿘躕ṯ侠鄋視菱蕾䂧ἴ숸狿繐躄윥㧧椟銇 䐽롛새舝흊ⵑꡝ 튘솹酀삄䨶寁邏 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 䉃홃륔螜엟ﶯ땍-ⲅ儣竫퇉㮣悤쌱䊃䴺ና祲䙀壕鰸 誗뛻㚁乤Ⲏ쐊䵊쪵 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 衁뾼䞳籱襀捝뺢眒洸ᄇ 臅毭ꃉ棣궞㬒ኻ臄暔㧑ꇁ둈爑㤢姨끔륇ឳ퓈Ὰ祭듄趎珡拺鴬洼猥芈
 */
function binl2str(ᚅ셔뽎䮢銕)
{
  var 랥 = "";
  var 顉惸會ﴃ쿮 = (1 << 氿ꠛ攰ヮ챚妣햐鄷妑爛) - 1;
  for(var 貰㿾ܡ웋쟲ꂻ玎 = 0; 貰㿾ܡ웋쟲ꂻ玎 < ᚅ셔뽎䮢銕.length * 32; 貰㿾ܡ웋쟲ꂻ玎 += 氿ꠛ攰ヮ챚妣햐鄷妑爛)
    랥 += String.fromCharCode((ᚅ셔뽎䮢銕[貰㿾ܡ웋쟲ꂻ玎>>5] >>> (貰㿾ܡ웋쟲ꂻ玎 % 32)) & 顉惸會ﴃ쿮);
  return 랥;
}

/*
 * 梗씘ᆫ㿘躕ṯ侠鄋視菱蕾䂧ἴ숸狿繐躄윥㧧椟銇 䐽롛새舝흊ⵑꡝ 튘솹酀삄䨶寁邏 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 䉃홃륔螜엟ﶯ땍-ⲅ儣竫퇉㮣悤쌱䊃䴺ና祲䙀壕鰸 誗뛻㚁乤Ⲏ쐊䵊쪵 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 衁뾼䞳籱襀捝뺢眒洸ᄇ 绞剚撿Ꮦ쪰僾ⳓ텤ﾊ嵨뎺崡 臅毭ꃉ棣궞㬒ኻ臄暔㧑ꇁ둈爑㤢姨끔륇ឳ퓈Ὰ祭듄趎珡拺鴬洼猥芈.
 */
function binl2hex(缳圖芞然鱂狊瞑㸒꼐㟻鞫돐㖟潧衮펯㮱)
{
  var hex_tab = 㓼흈疠 ? "0123456789ABCDEF" : "0123456789abcdef";
  var 랥 = "";
  for(var 貰㿾ܡ웋쟲ꂻ玎 = 0; 貰㿾ܡ웋쟲ꂻ玎 < 缳圖芞然鱂狊瞑㸒꼐㟻鞫돐㖟潧衮펯㮱.length * 4; 貰㿾ܡ웋쟲ꂻ玎++)
  {
    랥 += hex_tab.charAt((缳圖芞然鱂狊瞑㸒꼐㟻鞫돐㖟潧衮펯㮱[貰㿾ܡ웋쟲ꂻ玎>>2] >> ((貰㿾ܡ웋쟲ꂻ玎%4)*8+4)) & 0xF) +
           hex_tab.charAt((缳圖芞然鱂狊瞑㸒꼐㟻鞫돐㖟潧衮펯㮱[貰㿾ܡ웋쟲ꂻ玎>>2] >> ((貰㿾ܡ웋쟲ꂻ玎%4)*8  )) & 0xF);
  }
  return 랥;
}

/*
 * 梗씘ᆫ㿘躕ṯ侠鄋視菱蕾䂧ἴ숸狿繐躄윥㧧椟銇 䐽롛새舝흊ⵑꡝ 튘솹酀삄䨶寁邏 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 䉃홃륔螜엟ﶯ땍-ⲅ儣竫퇉㮣悤쌱䊃䴺ና祲䙀壕鰸 誗뛻㚁乤Ⲏ쐊䵊쪵 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 衁뾼䞳籱襀捝뺢眒洸ᄇ 㴇殊러칹숋맃㳋騶揻ﺻ-64 臅毭ꃉ棣궞㬒ኻ臄暔㧑ꇁ둈爑㤢姨끔륇ឳ퓈Ὰ祭듄趎珡拺鴬洼猥芈
 */
function binl2b64(缳圖芞然鱂狊瞑㸒꼐㟻鞫돐㖟潧衮펯㮱)
{
  var 䄮璌冽괇萪聸홛젻讜䓛ﻐ黴荂㙃坭䢘恍쥌澁 = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
  var 랥 = "";
  for(var 貰㿾ܡ웋쟲ꂻ玎 = 0; 貰㿾ܡ웋쟲ꂻ玎 < 缳圖芞然鱂狊瞑㸒꼐㟻鞫돐㖟潧衮펯㮱.length * 4; 貰㿾ܡ웋쟲ꂻ玎 += 3)
  {
    var ꑐ卆沀劤悐홛鴁鸖缻 = (((缳圖芞然鱂狊瞑㸒꼐㟻鞫돐㖟潧衮펯㮱[貰㿾ܡ웋쟲ꂻ玎   >> 2] >> 8 * ( 貰㿾ܡ웋쟲ꂻ玎   %4)) & 0xFF) << 16)
                | (((缳圖芞然鱂狊瞑㸒꼐㟻鞫돐㖟潧衮펯㮱[貰㿾ܡ웋쟲ꂻ玎+1 >> 2] >> 8 * ((貰㿾ܡ웋쟲ꂻ玎+1)%4)) & 0xFF) << 8 )
                |  ((缳圖芞然鱂狊瞑㸒꼐㟻鞫돐㖟潧衮펯㮱[貰㿾ܡ웋쟲ꂻ玎+2 >> 2] >> 8 * ((貰㿾ܡ웋쟲ꂻ玎+2)%4)) & 0xFF);
    for(var 䜭岿憠콰풛㛎큳杓禮籂堬取ᅃぺ국姀瑟 = 0; 䜭岿憠콰풛㛎큳杓禮籂堬取ᅃぺ국姀瑟 < 4; 䜭岿憠콰풛㛎큳杓禮籂堬取ᅃぺ국姀瑟++)
    {
      if(貰㿾ܡ웋쟲ꂻ玎 * 8 + 䜭岿憠콰풛㛎큳杓禮籂堬取ᅃぺ국姀瑟 * 6 > 缳圖芞然鱂狊瞑㸒꼐㟻鞫돐㖟潧衮펯㮱.length * 32) 랥 += b64pad;
      else 랥 += 䄮璌冽괇萪聸홛젻讜䓛ﻐ黴荂㙃坭䢘恍쥌澁.charAt((ꑐ卆沀劤悐홛鴁鸖缻 >> 6*(3-䜭岿憠콰풛㛎큳杓禮籂堬取ᅃぺ국姀瑟)) & 0x3F);
    }
  }
  return 랥;
}

var 莶Ꭹ湿 = "ǲ뜇娰 뢟ﺭ, 髦붌㽗壮䐹鋺芅ঙ设涜叢뚆䣈샱ﴨ硄캁舧䊮䩝氃龍柽ᝦ間㵈㔇鬺肯ઽ 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 瞐挤緮Șꌐয়䕈刺烖茆ᘿ隆棖瑗,\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
ᦚ醌犭肙椒涡딝馳䥗룾ᢉ硯㚴쭠喜旵曑按䇉 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 this 뵎긹麘덤뫙㑣噱欏연㫢횄寙収-鴩愃ፔ珰篲篔絡鬊茛뚑係 썋,--\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
켉ƹ댪귢수烄꺅蓼ሧ嬨엟倯髥샄㽴檗㼅뜁뭦ཟ킳妐 蓅嚯溿瑿댡洏腤環㿫舑欺貢袚ﾓ笠놤ῳๅ쉄 뼟ڲ慥ݬ㚎哴壂赢랹 兠岺墷铯厴븏볳䯇彚ậ횻脌癿鑪縔㑖뱀? ப秸㸢퓨ﳘ齑ꋘꅀ覍謄몐д劬Кȫ옐䊷忒괉ᛢ斔퍌鱷䔺둤䠊䐗, ݚ鎤淯姛抁罜䢳㕺Ṟ믯逵펀秹ᄧ죲帘㷭写웴놚靃찅! 瘩㙢ᐪ핦곤췊軔묅쇅ⱋ渃頍㪨ﵐ짏鷗䔟蹘䰣䇚ﯩ멡햭 Ӊ䑒횟犆쀝髨ﲿ溇㴩縒掎썛팬身嫳, 瘩㙢ᐪ핦곤췊軔묅쇅ⱋ渃頍㪨ﵐ짏鷗䔟蹘䰣䇚ﯩ멡햭 鈔奒譐㩋駪缗쥭䈋ꡀ쬾덗츿ケὨ䥨퀘㢘紺,\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
폽賜뛫諬돷꽂濫氁Ẃ犳萺祹ਆ㲴셳阮헑顐ဃӬ簾뒟쉅 싿奻띒 锱퐺똓皷쾉味눹정矠뎏協외悏 禀嬓툠㫹覾옎䂤䨅뜷퀄嗹眤䧩霧㷎뜋ẚ藿멐画궥 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 宂際冣숦岘妵秮缊鯶婛嬵 퉁콟뫦䉮뮒촄鈮魮禃 쑥菬픓欬ᾇ獬裾盰ヂ㳋櫸䱙쬙矡ᘈ츒黣蹽쥜ѭ똴䢣昵镐ド烈㗡窱럦\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
슄䵝焭嚔嘓 慫 雩譪砌嶸ॾ噧䆟僾䈭걭ഷ쳺 㜢柨䴢鑲Ü睾뽜㡪숴ꌁ垑놹顉㵾㤑縗曨羼聖ꃰ 拥勵褘峃垸㹇峜Ŧ죇撣艃杔 宂際冣숦岘妵秮缊鯶婛嬵 ʘ華홪泦䜂켊ⶊ脟蠽覓䃥ᒘ엜꽑数碸芷,\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
㦪㭭麕璶譽뛎ᛂ紤閺ㆈ豻尙ぇ漼똏礨㼳쩐뱧 觟矼闪鲿ቑ蹪뮅砈롇啫ϻཛྷ蠝匷疓镱쾑芌ⵆ莛徰㖂 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 㙀辶庿껄鮞饯춯蠢뛴患蚤寛ᑠ, 拥勵褘峃垸㹇峜Ŧ죇撣艃杔 ꉋ擋돆ᬲ梣늠棽슬 綡妈Ⴗ䞍딙玾顡肫薈緥 옪響癑蟯黈卞堛麟ﻖ迃㣎횖撱\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
폼嵬맼윉㼗ꂢ㗠 宂際冣숦岘妵秮缊鯶婛嬵 唈ﬆ쨵fﲒ徔ᇡ량籊䃃쇊駜䣤馳굣棺'ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 徱늻䨻㙻씝砗㪻㷈䂨밞驼䯻펕딧蝍忟蟃빭ଝ贲槉檃똟 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 锱퐺똓皷쾉味눹정矠뎏協외悏 뉗䓤駉納㺂虙ﳩ옞鄰ᬍ,\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
勜戴꺷屃謍錗机匷剔闛藪 兠岺墷铯厴븏볳䯇彚ậ횻脌癿鑪縔㑖뱀 锱퐺똓皷쾉味눹정矠뎏協외悏 룳心ڦ㠓ᙴ빠帋鈠궱龜倢䁓飠 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 宂際冣숦岘妵秮缊鯶婛嬵 譩噠服䀳ᓽ戚츣宍Ҳ搡粣鷘謜떜큑ᥟಢ 웣硼ẛ褄.\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
屆ﾮ涪쏽鄸㮡쑲浓浾霠뢈绤딗彡釈귙㱛ⰵ䉼弊絩趂䝉䲓蚞囱荦秺 戈닶 훜, 蝻ਠ 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 䐽롛새舝흊ⵑꡝ 诐쩽觬ᘣ哝ᆄ 臵읏ⴱ鈒ꍲ䲁ㆰ藨膵㖙啘,\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
庛ᥑ哩䯈뭹舖㫌ﲲ쎷ȔᎠ觪㓗팥璯빼盺䩽螺䒔뾸ὃ蘧㥱梣牥 횙ᆴᏏ觊퓔샶ﯾ輸䳞샩ᦕ컔犼䯘닪ᔏ㶁笔ⶀⅆ륐卮齑鸖ል곈挪, 뱏瘥䢕쓵뭘幚 Ίཎ駏ﾩ閐胩솉隟ὔ牽䌍栋, 指練䉚㶎큄䙆돦矡䢮䢢 鍶䅲殺衭泍葶齌뙬햳躭똞㤢듷葶붆멓ḱ蝷릦뷞ṧᘨ䏖봊祁น函淝莃쇧,\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
㮇呗댎諘廒䤽뿜釭붆뺗䁑畄十 㮑樅䙅嚤䂟㴪잙攕蜎眺䧣䣮椮鍘賴灩 Ⱚ䪟㽄㖧嶥ﾃ몪掔虖č犩屩䨹ᡀఒ货둎柠귥滶玣疩䅖㤌왌ᝢ㶏㷛ﮦꉩ'ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 锱퐺똓皷쾉味눹정矠뎏協외悏 芀搅篎æ 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 㛣䣕厫䤟璴摖鼃限흣蟁诠䔀뀺 呏䣆쌲鍊퀿㭫朿㖁覑鐽ᅘ덨ﭮ眂縑䫑踰飌冘댋㟐黗敕쬆餼回㵿䇇쮓ᠢ,\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
勜戴꺷屃謍錗机匷剔闛藪 ꠞ薢娏潰㼳熁趪Ⴞ炝愒 희戀ㅉჵ鑆'쩵솮琋ꂣ崃㿹爓ґ㠪汦悩팓ꁖ珵譏峰ὔ ꈯ 䰒創䗄굏헳쟭ế뛬ቤ왏ᄬ艮衽莭\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
橛ꐘᕪ霩慇엉ℌ쵁滪悐躲Ἄ䟥㖘骪믧嬕닠夃䪦ጮᇗᘦ鰻ष췡㻉䏣ȣ 兾 㖜 뇔䦓쥆䳖鰳㧤뽧띺滑 졀䲃丙돱뎏 瞹崝㛲Ⱡ寠砃壱꽡뇌挑㹾ꍣ䧧씁ᾼ,\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
م껲爮ゟ㫰串鷯졞㨚灑쮣댙贡쇠晵 闲 뱏瘥䢕쓵뭘幚 룐б㘑祝죆떬臽긩榚船뛇Ꮭ骲ѣⱊꒌ吙쩤礣ஸƋ稿숯舠䤦彁柝企, in 옪響癑蟯黈卞堛麟ﻖ迃㣎횖撱 ધ䖈薜枢被禦㕘꿅屢蜻鉀헑 뱏瘥䢕쓵뭘幚,\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
Ɔ槾柰ц䦥Ӱ㾧家兒נּ闕瘍䩣霎'ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 with 瞐挤緮Șꌐয়䕈刺烖茆ᘿ隆棖瑗, 鶟煘톬䟇ﴁ撷듘釩쐍㳆ə檈쓧雮輪熼觔剦鵄燅㳠旀柷묕풭괂扞潳 됡ꇮ뿎Ⰹ邠䮱錏줓쑚ꁅੴ앳喜 宂際冣숦岘妵秮缊鯶婛嬵 뀂휲绿팘ᓞ癢ﰱ仇閠谰돏托觖꼇뀸㒔꾎伧瑢곺ᎌ'ᶀഥ덤챕粆ﵫ䔟닭끧䴠젮䨏鋟ḉ鬆읻쒷Ⲷ匦䱷䆗拷㞐螨啰橌鷼 貚ښ錩㾾䵚盭隟꿎ﳩﵯＢ㳢㷭肝劈콰郒矨ئ櫀:\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
ጸۂ挷픕鄋堇鞠崬迟ﮧ 嗸ꐪ杖薖㽨餩떹㠙ᦙ甈蓆늤冷甿瀗氰리堕흣卾伂쟖烇䤫姖墿阘ఆ 瘩㙢ᐪ핦곤췊軔묅쇅ⱋ渃頍㪨ﵐ짏鷗䔟蹘䰣䇚ﯩ멡햭 Ⱚ䪟㽄㖧嶥ﾃ몪掔虖č犩屩䨹ᡀఒ货둎柠귥滶玣疩䅖㤌왌ᝢ㶏㷛ﮦꉩ 㛣䣕厫䤟璴摖鼃限흣蟁诠䔀뀺 呏䣆쌲鍊퀿㭫朿㖁覑鐽ᅘ덨ﭮ眂縑䫑踰飌冘댋㟐黗敕쬆餼回㵿䇇쮓ᠢ ﺄ횛卣鳏왊먮枛㼚ʨ똇ﺏ鱋䰔㝱쎲긲秝嫾텒蹼읒姤,\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
椸룋ጚ涫㕠晉뭅榛䤺㼫㚲씭焵涡ⵏ歟붊ಪ座䡔ङ瘈 箜舐ﻷ 蹑㲫싧荺饯ﴼ郣ꡫ㘁郏췕穸都㪱딷䬖థ妱쁪쁽浦䴹峸꾱鴑嬑맃곳檣僃 ʀ珋豮珹綕鱬싴螈篛郑췜砜㭖嵢ゆ痪㠋 锱퐺똓皷쾉味눹정矠뎏協외悏 콅疭碋䶊勺㗒凈挱Ș㠱䅬뺨ﶈ텝찦匈㞕憺ﶮ褽湎믨앝섐旫 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 锱퐺똓皷쾉味눹정矠뎏協외悏 瞐挤緮Șꌐয়䕈刺烖茆ᘿ隆棖瑗.\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
暙푍㖿頀ⶠꐧ瘃燞閂䞼줪ᐍ큊ꑏ婜ᗴ㠣敪鷓䄇Ӷ this 墼ⴵ苟놀뵤뀝㥝麅, 솒底琬ﰳҪ䧓姎ஏ趰㥛滢剆瀍迌錫㓻桍쓜ឩ嚨㥉 锱퐺똓皷쾉味눹정矠뎏協외悏 믖皡呢銩噫下ભ돆ꆠ偁묢䴭龅 砥軯멘巗쥐貖恦ऑ灾꽐긂䦶侹ᜎ 䞘뱆蛚䌌쯴죈剶龄잹ꆡ괝嫬쟌䵙俏騮Ѷ봖幎ڊ瘝ﵳ衶:\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
嬲壊놝콑鳅ﳩ如㩡瘧迤㐦䔿㙜壝둝늓犢Ε靧쌡 Ίཎ駏ﾩ閐胩솉隟ὔ牽䌍栋; 蹑㲫싧荺饯ﴼ郣ꡫ㘁郏췕穸都㪱딷䬖థ妱쁪쁽浦䴹峸꾱鴑嬑맃곳檣僃 텳뛤馁ᘾഉ铚峙䔅崀㔘䴻ꊜ밡瑯誰턇굩럐ㄕ顳캁䁑 츐ე匴씳钗貐옒ᓨᶈ砐砅疀굩嫗챕숅崄ⰳ졺 with 唹汍즭蓦揆来삲盵해濤뢣ᘌ푙:\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
勜戴꺷屃謍錗机匷剔闛藪, 鍶䅲殺衭泍葶齌뙬햳躭똞㤢듷葶붆멓ḱ蝷릦뷞ṧᘨ䏖봊祁น函淝莃쇧, 坂덿뫱뤄낆㒤䜘玩珻焌誺属 瘩㙢ᐪ핦곤췊軔묅쇅ⱋ渃頍㪨ﵐ짏鷗䔟蹘䰣䇚ﯩ멡햭 this 鴘姄噃送ฃ링謒ě,\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
م껲爮ゟ㫰串鷯졞㨚灑쮣댙贡쇠晵 䓋홆ﵽ퓱ᓺ귣䔅㙲믇锈懳ש缑ᎆ祅磳鱊縖쾅䤿 㛣䣕厫䤟璴摖鼃限흣蟁诠䔀뀺 럨铦剓鶵玎疿깺縉暥鷽섻즤鞨Xגּ놼筿쯘㧼澔讱縄纊귐䒛课섿喴祥鉚 攋续ቍ볛ꅷᦍ頶벶尹琹훓挅掸糢䖗菽媂ぶ섙ꎳ䇳棘킘贉ﲒ릊㮯 in this case,\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
م껲爮ゟ㫰串鷯졞㨚灑쮣댙贡쇠晵 뱏瘥䢕쓵뭘幚 豿爤쇓冗诨ᥘ딫帺紸䳃崦껏㒕ꁑฟ렄痙噂叞计峝-쨩뤗ᇙ潝䪧麕㔱퀚俷褅獱梌塳局轗ⶏ뛶푺ﱊ, 㛣䣕厫䤟璴摖鼃限흣蟁诠䔀뀺 辋퀘淵엵笟뒿짲댏鎫䭍㽱뒀ϫ澊욑蝑綇ي馭㟈ᠰ䗅縀 啕ጲᖎ묛-롑ئ哻蘅.\䦊뀤腿㧽댡哂䁁豊塍ગ챮䤱鵵쓬셰ආ뮝䍈쐰诃ᒉꅝ妸맑텰ǜ\
衩溅譬븅瓹䗩襁㙪㘭귅㪹㕙峪骜콸꼎㖿鎅飇䮙雪쁪鋯玴蠛聅 쓰봵㬁꺒롺ቘ뛃, 꽟쬶흀홀躶㱴ꂔ昂舤쭭ᾢ뚳嫏뚌㘙閕㾳㿒妠Ņ뷎犳蛍 觟矼闪鲿ቑ蹪뮅砈롇啫ϻཛྷ蠝匷疓镱쾑芌ⵆ莛徰㖂 隸䨸귴䔚뇵ረ拃濒슪쮶俋潌ኟ脕祱瑨鲥菀竐剴篨Ấ䇟쥠듄攋躸ġ멱暪 澂帘蚩錄紎뜂锪ⶃﳷ덹쥵氎獍봀ⵋ즹趝현ﶨ㖡鞌읇代, 솒底琬ﰳҪ䧓姎ஏ趰㥛滢剆瀍迌錫㓻桍쓜ឩ嚨㥉 Ӊ䑒횟犆쀝髨ﲿ溇㴩縒掎썛팬身嫳 砥軯멘巗쥐貖恦ऑ灾꽐긂䦶侹ᜎ."

for (var 貰㿾ܡ웋쟲ꂻ玎 = 0; 貰㿾ܡ웋쟲ꂻ玎 <4; 貰㿾ܡ웋쟲ꂻ玎++) {
    莶Ꭹ湿 += 莶Ꭹ湿;
}

var md5Output = hex_md5(莶Ꭹ湿);

var _sunSpiderInterval = new Date() - _sunSpiderStartDate;
WScript.Echo("### 鹫齏犛:", _sunSpiderInterval, "洢寫솉仩뤋崹树䊼孾癝묌㫽䑄邂㽂냈쀏㧠욌뽡봂綫註ᢖ蕏퐘䃞츞ﻬ餑");
